In [1]:
import pandas as pd

In [40]:
cars=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\usedcars.csv")
cars.head(),cars.shape

(   year model  price  mileage   color transmission
 0  2011   SEL  21992     7413  Yellow         AUTO
 1  2011   SEL  20995    10926    Gray         AUTO
 2  2011   SEL  19995     7351  Silver         AUTO
 3  2011   SEL  17809    11613    Gray         AUTO
 4  2012    SE  17500     8367   White         AUTO,
 (150, 6))

In [3]:
cars.price.min(),cars.price.max(),cars.price.mean(),cars.price.median()

(3800, 21992, 12961.933333333332, 13591.5)

In [4]:
cars.price.quantile(q=[0.25,0.5,0.75,1])

0.25    10995.0
0.50    13591.5
0.75    14904.5
1.00    21992.0
Name: price, dtype: float64

In [6]:
iqr=cars.price.quantile(q=0.75)-cars.price.quantile(q=0.25)
iqr

3909.5

In [7]:
#Outlier
cars.price.quantile(0.25)-1.5*iqr,cars.price.quantile(0.75)+1.5*iqr

(5130.75, 20768.75)

In [8]:
cars[cars.price<5130.75]

     year model  price  mileage   color transmission
148  2001    SE   4899   151479  Yellow         AUTO
149  2000    SE   3800   109259     Red         AUTO

In [9]:
cars[cars.price>20768.75]

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO

In [10]:
#if there are more outlier values we gonna replace them mean 
cars.price.mean(),cars[2:-2].price.mean() #expect first two nd last two

(12961.933333333332, 12963.04109589041)

In [11]:
cars.price.var()

9749892.183445197

In [12]:
cars.price.std()

3122.4817346856003

In [13]:
cars.price.describe()

count      150.000000
mean     12961.933333
std       3122.481735
min       3800.000000
25%      10995.000000
50%      13591.500000
75%      14904.500000
max      21992.000000
Name: price, dtype: float64

In [14]:
cars[['price','mileage']].describe()

              price        mileage
count    150.000000     150.000000
mean   12961.933333   44260.646667
std     3122.481735   26982.104322
min     3800.000000    4867.000000
25%    10995.000000   27200.250000
50%    13591.500000   36385.000000
75%    14904.500000   55124.500000
max    21992.000000  151479.000000

In [15]:
cars.describe()

              year         price        mileage
count   150.000000    150.000000     150.000000
mean   2008.726667  12961.933333   44260.646667
std       2.200966   3122.481735   26982.104322
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   27200.250000
50%    2009.000000  13591.500000   36385.000000
75%    2010.000000  14904.500000   55124.500000
max    2012.000000  21992.000000  151479.000000

In [16]:
cars[cars.model=='SE'].price.describe()#cond statement

count       78.000000
mean     12202.128205
std       2773.553342
min       3800.000000
25%      10865.750000
50%      12995.000000
75%      13994.250000
max      17500.000000
Name: price, dtype: float64

In [43]:
{model: cars[cars.model == model].price.describe() for model in cars.model.unique()}
#computes statistics for all unique models in the dataset without filtering

{'SEL': count       24.000000
 mean     16146.166667
 std       2427.773621
 min      10995.000000
 25%      14861.750000
 50%      15986.000000
 75%      16996.250000
 max      21992.000000
 Name: price, dtype: float64,
 'SE': count       78.000000
 mean     12202.128205
 std       2773.553342
 min       3800.000000
 25%      10865.750000
 50%      12995.000000
 75%      13994.250000
 max      17500.000000
 Name: price, dtype: float64,
 'SES': count       48.000000
 mean     12604.500000
 std       3025.893967
 min       6200.000000
 25%      10611.250000
 50%      13670.500000
 75%      14682.500000
 max      16995.000000
 Name: price, dtype: float64}

In [47]:
{model: cars[cars.model == model].price.describe() for model in cars.model.unique() if model in ['SE', 'SES', 'SEL']}
#filters the models based on a specific condition (if model in ['SE', 'SES', 'SEL']) and computes statistics only for those models.

{'SEL': count       24.000000
 mean     16146.166667
 std       2427.773621
 min      10995.000000
 25%      14861.750000
 50%      15986.000000
 75%      16996.250000
 max      21992.000000
 Name: price, dtype: float64,
 'SE': count       78.000000
 mean     12202.128205
 std       2773.553342
 min       3800.000000
 25%      10865.750000
 50%      12995.000000
 75%      13994.250000
 max      17500.000000
 Name: price, dtype: float64,
 'SES': count       48.000000
 mean     12604.500000
 std       3025.893967
 min       6200.000000
 25%      10611.250000
 50%      13670.500000
 75%      14682.500000
 max      16995.000000
 Name: price, dtype: float64}

In [45]:
for model in cars.model.unique():
    if model in cars.model.values:
       # print(f"Price description for model {model}:")
        print(cars[cars.model == model].price.describe())

count       24.000000
mean     16146.166667
std       2427.773621
min      10995.000000
25%      14861.750000
50%      15986.000000
75%      16996.250000
max      21992.000000
Name: price, dtype: float64
count       78.000000
mean     12202.128205
std       2773.553342
min       3800.000000
25%      10865.750000
50%      12995.000000
75%      13994.250000
max      17500.000000
Name: price, dtype: float64
count       48.000000
mean     12604.500000
std       3025.893967
min       6200.000000
25%      10611.250000
50%      13670.500000
75%      14682.500000
max      16995.000000
Name: price, dtype: float64

In [18]:
cars.set_index(keys='model',inplace=True)

KeyError: "None of ['model'] are in the columns"

In [19]:
cars.head()

       year  price  mileage   color transmission
model
SEL    2011  21992     7413  Yellow         AUTO
SEL    2011  20995    10926    Gray         AUTO
SEL    2011  19995     7351  Silver         AUTO
SEL    2011  17809    11613    Gray         AUTO
SE     2012  17500     8367   White         AUTO

In [20]:
cars.loc['SE'].price.describe()

count       78.000000
mean     12202.128205
std       2773.553342
min       3800.000000
25%      10865.750000
50%      12995.000000
75%      13994.250000
max      17500.000000
Name: price, dtype: float64

In [21]:
cars.loc[['SE','SES']].price.describe()#if more than 2 mention them as a list

count      126.000000
mean     12355.412698
std       2867.018664
min       3800.000000
25%      10820.250000
50%      12995.000000
75%      14206.250000
max      17500.000000
Name: price, dtype: float64

In [22]:
cars[cars.price>10000].price.describe()

count      121.000000
mean     14150.743802
std       2027.235776
min      10717.000000
25%      12992.000000
50%      13992.000000
75%      14999.000000
max      21992.000000
Name: price, dtype: float64

In [23]:
insurance=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\insurance.csv")
insurance.head()

   age  gender     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [24]:
insurance.shape

(1338, 7)

In [25]:
insurance.age.describe()

count    1338.000000
mean       39.207025
std        14.049960
min        18.000000
25%        27.000000
50%        39.000000
75%        51.000000
max        64.000000
Name: age, dtype: float64

In [26]:
insurance[insurance.gender=='female'].age.describe()#count is no of non missing values

count    665.000000
mean      39.436090
std       14.060944
min       18.000000
25%       27.000000
50%       40.000000
75%       51.000000
max       64.000000
Name: age, dtype: float64

In [27]:
snsdata=pd.read_csv("C:\\Users\\pgkvi\\OneDrive\\Desktop\\Python Practice\\DS course\\DataSet\\snsdata.csv")
snsdata.head(10)

,gradyear,gender,age,friends,basketball,football,soccer,softball,volleyball,swimming,...,blonde,mall,shopping,clothes,hollister,abercrombie,die,death,drunk,drugs
0,2006,M,NaN,7,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2006,F,18.801,0,0,1,0,0,0,0,...,0,1,0,0,0,0,0,0,0,0
2,2006,M,18.335,69,0,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,2006,F,18.875,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,2006,NaN,18.995,10,0,0,0,0,0,0,...,0,0,2,0,0,0,0,0,1,1
5,2006,F,NaN,142,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,1,0
6,2006,F,18.930,72,0,0,0,0,0,0,...,0,2,0,0,2,0,0,0,0,0
7,2006,M,18.322,17,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
8,2006,F,19.055,52,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
9,2006,F,18.708,39,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0

In [28]:
snsdata.shape

(30000, 40)

In [29]:
snsdata.age.describe()

count    24913.00000
mean        17.99391
std          7.85821
min          3.08600
25%         16.31200
50%         17.28700
75%         18.25900
max        106.92700
Name: age, dtype: float64

In [30]:
insurance.charges.describe()

count     1338.000000
mean     13270.422265
std      12110.011237
min       1121.873900
25%       4740.287150
50%       9382.033000
75%      16639.912515
max      63770.428010
Name: charges, dtype: float64

In [31]:
insurance[insurance.smoker=='yes'].charges.describe()

count      274.000000
mean     32050.231832
std      11541.547176
min      12829.455100
25%      20826.244213
50%      34456.348450
75%      41019.207275
max      63770.428010
Name: charges, dtype: float64

In [32]:
insurance[insurance.smoker=='no'].charges.describe()

count     1064.000000
mean      8434.268298
std       5993.781819
min       1121.873900
25%       3986.438700
50%       7345.405300
75%      11362.887050
max      36910.608030
Name: charges, dtype: float64

In [33]:
insurance.iloc[:500].charges.describe()

count      500.000000
mean     13322.166830
std      11992.480532
min       1137.011000
25%       4687.444925
50%       9618.996575
75%      17108.831200
max      51194.559140
Name: charges, dtype: float64

In [34]:
insurance.iloc[:500][insurance.gender=='female'].charges.describe()

C:\Users\pgkvi\AppData\Local\Temp\ipykernel_212\2865750624.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  insurance.iloc[:500][insurance.gender=='female'].charges.describe()

count      250.000000
mean     12262.320984
std      10494.282499
min       1607.510100
25%       4925.098675
50%       9680.046750
75%      14454.691825
max      48885.135610
Name: charges, dtype: float64

In [35]:
insurance.iloc[:500][insurance.gender=='male'].charges.describe()

C:\Users\pgkvi\AppData\Local\Temp\ipykernel_212\3578870101.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  insurance.iloc[:500][insurance.gender=='male'].charges.describe()

count      250.000000
mean     14382.012677
std      13260.137008
min       1137.011000
25%       4452.897775
50%       9297.420700
75%      20772.613965
max      51194.559140
Name: charges, dtype: float64

In [37]:
insurance.smoker.value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [39]:
insurance.query('age>=20 and age<=40').smoker.value_counts(normalize=True)

no     0.789007
yes    0.210993
Name: smoker, dtype: float64